cf/Reports/ПланФактныйАнализБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ПланФактныйАнализБюджета</Name>
		</Properties>
	</Report>
</MetaDataObject>

cf/Documents/ФактическиеДанныеБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ФактическиеДанныеБюджетирования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Бюджетирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики1</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики2</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики3</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Reports/ПланФактныйАнализБюджета/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьПолеРасшифровки(Расшифровка)
	
	КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	КоллекцияПолей = КоллекцияРасшифровки.Элементы[Расшифровка].ПолучитьПоля();
    
  //  КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
    Если КоллекцияПолей.Количество() > 0 Тогда 
    	Возврат  КоллекцияПолей[0].Поле;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруОтбора(Расшифровка, СтруктураПараметров)
	
	КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	КоллекцияРодителей = КоллекцияРасшифровки.Элементы[Расшифровка].ПолучитьРодителей();
	
	Для Каждого Родитель ИЗ КоллекцияРодителей Цикл
	
		ИдентификаторПоля = Родитель.Идентификатор;
		ПоляВыбора = КоллекцияРасшифровки.Элементы[ИдентификаторПоля].ПолучитьПоля();
	
		Для Каждого выбПоле Из ПоляВыбора Цикл
			Если СтруктураПараметров.Свойство(выбПоле.Поле) Тогда
					СтруктураПараметров.Вставить(выбПоле.Поле, выбПоле.Значение); КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецФункции


&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	ПолеРасшифровки = ПолучитьПолеРасшифровки(Расшифровка);

	Если ПолеРасшифровки = "СуммаФакт" Тогда 	СтандартнаяОбработка = Ложь;

		СтруктураПараметров = Новый Структура("Период, ДатаНачала, ДатаОкончания, Отдел, СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3");
		ПолучитьСтруктуруОтбора(Расшифровка, СтруктураПараметров);   
		
		Если СтруктураПараметров.Свойство("Период") Тогда
			СтруктураПараметров.ДатаНачала 		= СтруктураПараметров.Период;
			СтруктураПараметров.ДатаОкончания 	= КонецМесяца(СтруктураПараметров.Период);
		Иначе Возврат;
		КонецЕсли;
		
		РезультатРасшифровки = Новый ТабличныйДокумент;

		ДанныеВложеннойРасшифровки ="";
		АдресСхемы = "";
		
		ПоказателиСуммаОткрытиеНаСервере(СтруктураПараметров, РезультатРасшифровки, ДанныеВложеннойРасшифровки, АдресСхемы, Новый УникальныйИдентификатор);
		ОткрытьФорму("Документ.ФактическиеДанныеБюджетирования.Форма.ФормаРасшифровки", Новый Структура("Результат, ДанныеРасшифровки, АдресСхемы", РезультатРасшифровки, ДанныеВложеннойРасшифровки, АдресСхемы), ЭтаФорма, Строка(УникальныйИдентификатор) + Строка(Расшифровка));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказателиСуммаОткрытиеНаСервере(СтруктураПараметров, РезультатРасшифровки, ДанныеВложеннойРасшифровки, АдресСхемы, ГУИД)
	
	Документы.ФактическиеДанныеБюджетирования.ОбработкаРасшифровкиФактическойСуммыБюджетирования(СтруктураПараметров, РезультатРасшифровки, ДанныеВложеннойРасшифровки, АдресСхемы, ГУИД);

КонецПроцедуры
